import styled from '@emotion/styled';
import sitePrefix from '~/sitePrefix';

const MESSAGE_LIST = [
  '꽥꽥 🦆 꽤앵액액ㅋㅋㅋㅋ🦆🦆꾀액액ㅋ액ㅋ액ㅋㅋㅋㅋㅋ액ㅋㅌㅋㅋㅋ꾁ㅋ꽥ㅋ 🦆 🦆 꽥꽥 🦆 꽤앵액액ㅋㅋㅋㅋ🦆🦆꾀액액ㅋ액ㅋ액ㅋㅋㅋㅋㅋ액ㅋㅌㅋㅋㅋ꾁ㅋ꽥ㅋ 🦆 🦆 꽥꽥 🦆 꽤앵액액ㅋㅋㅋㅋ🦆🦆꾀액액ㅋ액ㅋ액ㅋㅋㅋㅋㅋ액ㅋㅌㅋㅋㅋ꾁ㅋ꽥ㅋ 🦆 🦆 꽥꽥 🦆 꽤앵액액ㅋㅋㅋㅋ🦆🦆꾀액액ㅋ액ㅋ액ㅋㅋㅋㅋㅋ액ㅋㅌㅋㅋㅋ꾁ㅋ꽥ㅋ 🦆 🦆 꽥꽥 🦆 꽤앵액액ㅋㅋㅋㅋ🦆🦆꾀액액ㅋ액ㅋ액ㅋㅋㅋㅋㅋ액ㅋㅌㅋㅋㅋ꾁ㅋ꽥ㅋ 🦆 🦆 꽥꽥 🦆 꽤앵액액ㅋㅋㅋㅋ🦆🦆꾀액액ㅋ액ㅋ액ㅋㅋㅋㅋㅋ액ㅋㅌㅋㅋㅋ꾁ㅋ꽥ㅋ 🦆 🦆 꽥꽥 🦆 꽤앵액액ㅋㅋㅋㅋ🦆🦆꾀액액ㅋ액ㅋ액ㅋ 꽥꽥 🦆 꽤앵',
  '[속보] 응~👌🏻 어쩔티비~ 📺💁🏻‍♂️ 저쩔티비~📺 💁🏻‍♀️ 안물티비~안궁티비~뇌절티비~우짤래미~ 저짤래미~ 쿠쿠루삥뽕🕺🏻 지금 화났죠?🔥😛 개킹받죠? 죽이고 싶죠? 🤗어차피 내가 사는곳 모르죠? 응~못 죽이죠?👊🏻🤟🏻 어~또 빡치죠? 😌아무것도 모르죠? 아무것도 못하죠?😉 그냥 화났죠? 냬~알걨섑니댸👏🏻🙃🙃',
  '내머~리👨🏻‍🦲대머~리~👩🏻‍🦲될때까지너를좋아할거야💘 내머~리👨🏻‍🦲대머~리~👩🏻‍🦲될때까지너를좋아할거야💘 내머~리👨🏻‍🦲대머~리~👩🏻‍🦲될때까지너를좋아할거야💘 내머~리👨🏻‍🦲대머~리~👩🏻‍🦲될때까지너를좋아할거야💘 내머~리👨🏻‍🦲대머~리~👩🏻‍🦲될때까지너를좋아할거야💘 내머~리👨🏻‍🦲대머~리~👩🏻‍🦲될때까지너를좋아할거야',
  '널👋끊겠어❌어🚫어⛔️어⚠️뚝‼️끊어버❌어🚫어⚠️리겠어🔪마치금여🚬어어어언처럼난🔇서서히↘️줄여갈수는⏬없는📶거란걸🙅🏻‍♀️ 봐➡️아▶️아➡️아▶️ 각자👥의 이👫히👭히👬히👪힌생👨‍👩‍👧‍👦을 봐👀걸리적거▶️어➡️어▶️릴거야 벗어나야⤴️⤴️⤴️풀리는 거리의🏙와이파이📞처러어어🔔어엄🔕어어🔕어어어🔕어어엄🔕엄엄',
  '👥👥👥👥👥👤👤👤👤👥👤👥(수군)👤👥👤👥👤👤👤👥👥👥👤👤(웅성)👤👥👤👥👤👥(웅성웅성)👤👥👤👥👥👤👥👥👥👤(수군수군)👤👤👤👥👤👤👥👥👤👥👥👥🗣📣아아마이크테스트👥👥👥👤👤👥👤👥👤👤(수군수군)👤👤👥👤👤👥👤👥👥👤👤👤👥👥👤👥👤(쑥덕쑥덕)👥👤👥👤👥👤👥👥👤👥 👥👥👥👥👥👤👤👤👤👥👤👥(수군)👤👥👤👥👤👤👤👥👥👥👤👤(웅성)👤👥👤👥👤👥(웅성웅성)👤👥👤👥👥👤👥👥👥👥👥👤👤👤👤👥👤👥(수군)👤👥👤👥👤👤👤👥👥👥👤👤(웅성)👤👥👤👥👤👥(웅성웅성)👤👥👤👥👥👤👥👥👥👤(수군수군)👤👤👤👥👤👤👥👥👤👥👥👥🗣📣아아마이크테스트👥👥👥',
  'ㅋㅋ깔깔😂ㅋㅋ🌟ㅋ🌟ㅋㅋ우르롹끼🐒ㅋㅋ🌟ㅋ🌟ㅋㅋ깔깔😂ㅋㅋ🌟ㅋ🌟ㅋㅋ우르롹끼🐒ㅋㅋ🌟ㅋ🌟ㅋㅋ깔깔😂ㅋㅋ🌟ㅋ🌟ㅋㅋ우르롹끼🐒ㅋㅋ🌟ㅋ🌟ㅋㅋ깔깔😂ㅋㅋ🌟ㅋ🌟ㅋㅋ우르롹끼🐒ㅋㅋ🌟ㅋ🌟ㅋㅋ깔깔😂ㅋㅋ🌟ㅋ🌟ㅋㅋ우르롹끼🐒ㅋㅋ🌟ㅋ🌟ㅋㅋ깔깔😂ㅋㅋ🌟ㅋ🌟ㅋㅋ우르롹끼🐒ㅋㅋ🌟ㅋ🌟ㅋㅋ깔깔😂ㅋㅋ🌟ㅋ🌟ㅋㅋ우르롹끼🐒ㅋㅋ🌟ㅋ🌟ㅋㅋ깔깔😂ㅋㅋ🌟ㅋ🌟ㅋㅋ우르롹끼🐒ㅋㅋ🌟ㅋ🌟ㅋㅋ깔깔😂ㅋㅋ🌟ㅋ🌟ㅋㅋ우르롹끼🐒ㅋㅋ🌟ㅋ🌟ㅋㅋ깔깔😂ㅋㅋ🌟ㅋ🌟ㅋㅋ우르롹끼🐒ㅋㅋ🌟ㅋ🌟ㅋㅋ깔깔😂',
  '🎁🎉푸하하하하💕웃음보따리 파팡🎊🎁🎉푸하하하하💕웃음보따리 파팡🎊🎁🎉푸하하하하💕웃음보따리 파팡🎊🎁🎉푸하하하하💕웃음보따리 파팡🎊🎁🎉푸하하하하💕웃음보따리 파팡🎊🎁🎉푸하하하하💕웃음보따리 파팡🎊🎁🎉푸하하하하💕웃음보따리 파팡🎊🎁🎉푸하하하하💕웃음보따리 파팡🎊',
  '꺼이꺼이..😞.. 흐그극😭.. 흐국뚜흐국뚜리😢.. 앙앙엉엉😫..주르륵..컹..꺼이꺼이..😞.. 흐그극😭.. 흐국뚜흐국뚜리 꺼이꺼이..😞.. 흐그극😭.. 흐국뚜흐국뚜리😢.. 앙앙엉엉😫..주르륵..컹..꺼이꺼이..😞.. 흐그극😭.. 흐국뚜흐국뚜리 꺼이꺼이..😞.. 흐그극😭.. 흐국뚜흐국뚜리😢.. 앙앙엉엉😫..주르륵..컹..꺼이꺼이..😞.. 흐그극😭.. 흐국뚜흐국뚜리 꺼이꺼이..😞.. 흐그극😭.. 흐국뚜흐국뚜리😢.. 앙앙엉엉😫..주르륵..컹..꺼이꺼이..😞.. 흐그극😭.. 흐국뚜흐국뚜리',
  '참〰️치 👈요리로👈 참〰️치🐟 👉조리로👉 참〰️치🐟 이건 맛👅의 대🎋참🕺🏻치❗️ 참〰️치⁉️ 상추🥬쌈밥🍚으로 참〰️치⁉️ 샐러드🥗로 참〰️치⁉️ 이건 맛👅의 대🎋참💃🏻치❗️ 참🙆🏻‍♂️치 볶음밥🍲으로 참🙆🏻‍♂️치🐟 샌드위치🥪로 참🙆🏻‍♂️치🐟 이건 맛👅의 대🎋참✊🏻치‼️ 참🤷🏻‍♀️치〰️ 미역국🍵으로 참🤷🏻‍♀️치〰️ 까나페• • • 야야야🤦🏻‍♂️ 언제(when)까지 이노래(song)를 부를셈🎤이야🤔 참치🐟레시피📃 🖖조😮억개〰️🥰🎶 이건맛😋의 대🇰🇷참🇰🇷치🇰🇷',
  '🥑🥑앜ㅋㅋ🥑🥑🥑아봌ㅋㅋㅋㅋ🥑🥑🥑🥑ㅋㅋㅋㅋ아보가돜ㅋㅋ🥑🥑🥑🥑🥑🥑앜ㅋㅋ🥑🥑🥑아봌ㅋㅋㅋㅋ🥑🥑🥑🥑ㅋㅋㅋㅋ아보가돜ㅋㅋ🥑🥑🥑🥑🥑🥑앜ㅋㅋ🥑🥑🥑아봌ㅋㅋㅋㅋ🥑🥑🥑🥑ㅋㅋㅋㅋ아보가돜ㅋㅋ🥑🥑🥑🥑🥑🥑앜ㅋㅋ🥑🥑🥑아봌ㅋㅋㅋㅋ🥑🥑🥑🥑ㅋㅋㅋㅋ아보가돜ㅋㅋ🥑🥑🥑🥑',
  '하...당신...지금 \'\'오타쿠\'\'를 \'\'무시\'\'하는 건가요?! 『오타쿠』는 원래 \'\'무언가에 열중하는 사람\'\'이라는 뜻..이랄까..? 암튼 당신네들 「멸칭」이랑은 상관없다고!! 키사마 ..이것도 헌법위반에 명예훼손인 거 아려나 몰라? 아무튼 당신네들...이렇게 나온다면 나도 참는 건 절대로 「무리」..한 번만 더 그러면 정말로 부.숴.버.릴.거.야.',
  '한국다람쥐🐿~한국다람쥐🐿~한국한국다람쥐🐿~yeah다시🔄 돌아왔지😎 내 이름은 레인🌧 스웩👨‍🎤을 뽐내 Whoo~ They call it 왕🤴의 귀환 후배들🧒 바빠지는 중~! 👯 신발끈~ 👟 꽉 매고 스케쥴 all day👌 내 매니저 전화기📱는 조용🔇할 일이 없네🔉 Whoo~ 15년을 뛰어🏃‍♂️💨 모두가 인정해🙆‍♀️🙆‍♂️ 이 몸의 가치 💰 허나 자만하지 않지 🙅‍♂️ 매 순간 열심히 첫 무대🤸‍♂️와 같이 타고난난 이 멋🤟이 어디가 🤷‍♂️ 30  sexy 오빠👱‍♂️ 또 한번 무대를 적셔🚿 레인이펙트⛈️ 나.비.효.과🌊 화려한 조명✨이 나를 감싸네🧖‍♂ 시간⏰이 멈추길 기도해🙏~but I\'m not🧏‍♂️gonna cry😥 yeah~ 불꺼진🌬️🔥 무대 위 홀로👤 남아서 떠나간 🚶‍♀️ 그대의 목소릴 🗣️ 떠올리네 💡 나 쓰러질💫 때까지 널 위해 춤을 춰🕺',
  '예~🙋🏻‍♂️거참 🔥죄송하게🔥 됐습니다💤💤 🎊사죄의 🔈말씀🔈 드립니다🌟🎉🎉 예~🙋🏻‍♂️거참 🔥죄송하게🔥 됐습니다💤💤 🎊사죄의 🔈말씀🔈 드립니다🌟🎉🎉 예~🙋🏻‍♂️거참 🔥죄송하게🔥 됐습니다💤💤 🎊사죄의 🔈말씀🔈 드립니다🌟🎉🎉 예~🙋🏻‍♂️거참 🔥죄송하게🔥 됐습니다💤💤 예~🙋🏻‍♂️거참 🔥죄송하게🔥 됐습니다💤💤 🎊사죄의 🔈말씀🔈 드립니다🌟🎉🎉 예~🙋🏻‍♂️거참 🔥죄송하게🔥 됐습니다💤💤 🎊사죄의 🔈말씀🔈 드립니다🌟🎉🎉 예~🙋🏻‍♂️거참 🔥죄송하게🔥 됐습니다💤💤 🎊사죄의 🔈말씀🔈 드립니다🌟🎉🎉 예~🙋🏻‍♂️거참 🔥죄송하게🔥 됐습니다💤💤',
];

function onClickUhImage() {
  MESSAGE_LIST.forEach( message => {
    alert(message);
  });
}

export default function StickyFooter() {
  return (
    <Base>
      <ImageWrapper>
        <UhButton onClick={onClickUhImage}>
          <UhImage src={`${sitePrefix}/images/uh.png`} />
        </UhButton>
        <ChiledImage src={`${sitePrefix}/images/child.png`} />
      </ImageWrapper>
    </Base>
  );
}

const Base = styled.div`
  // position: fixed;
  // bottom: 0;
  // width: 100%;
  // left: 0;
  // right: 0;
`;
const ImageWrapper = styled.div`
  // display: flex;
  // align-items: center;
  // justify-content: center;
  // flex-direction: column;
  position: fixed;
  bottom: 0;
  left: 0;
  right: 0;
  width: 18rem;
  margin: 0 auto;
`;
const UhButton = styled.button`
  width: 100%;
  cursor: pointer;
`;
const UhImage = styled.img``;
const ChiledImage = styled.img``;
